<?xml version="1.0" ?>
<net name="candy" version="10">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,3,240,320"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="513517_const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="2" name="514518_const" type="Const" version="opset1">
			<data element_type="f32" offset="4" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="3" name="515519_const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="4" name="516520_const" type="Const" version="opset1">
			<data element_type="f32" offset="4" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="5" name="64/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="onnx_initializer_node_conv1.conv2d.weight/Output_0/Data__const162_const" type="Const" version="opset1">
			<data element_type="f32" offset="8" shape="32,3,9,9" size="31104"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="523527_const" type="Const" version="opset1">
			<data element_type="f32" offset="31112" shape="32,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="524528_const" type="Const" version="opset1">
			<data element_type="f32" offset="31240" shape="32,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="525529_const" type="Const" version="opset1">
			<data element_type="f32" offset="31368" shape="32,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="526530_const" type="Const" version="opset1">
			<data element_type="f32" offset="31496" shape="32,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="64/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="64/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="4,4" pads_end="4,4" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>3</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="64/Dims2516/copy_const164_const" type="Const" version="opset1">
			<data element_type="f32" offset="31624" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="64" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="893897_const" type="Const" version="opset1">
			<data element_type="f32" offset="31752" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="16" name="894898_const" type="Const" version="opset1">
			<data element_type="f32" offset="31756" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="17" name="895899_const" type="Const" version="opset1">
			<data element_type="f32" offset="31752" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="18" name="896900_const" type="Const" version="opset1">
			<data element_type="f32" offset="31756" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="19" name="65/Ins_Norm/MVN_/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="65/Ins_Norm/MVN_" type="MVN" version="opset2">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="onnx_initializer_node_in1.weight/Output_0/Data_/copy/copy_const167_const" type="Const" version="opset1">
			<data element_type="f32" offset="31760" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="65/Ins_Norm/mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="onnx_initializer_node_in1.bias/Output_0/Data_/copy/copy_const169_const" type="Const" version="opset1">
			<data element_type="f32" offset="31888" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="65/Ins_Norm/add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="66" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="993997_const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="27" name="994998_const" type="Const" version="opset1">
			<data element_type="f32" offset="32016" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="28" name="995999_const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="29" name="9961000_const" type="Const" version="opset1">
			<data element_type="f32" offset="32016" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="30" name="68/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="onnx_initializer_node_conv2.conv2d.weight/Output_0/Data__const172_const" type="Const" version="opset1">
			<data element_type="f32" offset="32020" shape="64,32,3,3" size="73728"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="10031007_const" type="Const" version="opset1">
			<data element_type="f32" offset="105748" shape="64,1,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="10041008_const" type="Const" version="opset1">
			<data element_type="f32" offset="106004" shape="64,1,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="10051009_const" type="Const" version="opset1">
			<data element_type="f32" offset="105748" shape="64,1,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="10061010_const" type="Const" version="opset1">
			<data element_type="f32" offset="106004" shape="64,1,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="68/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="68/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="68/Dims2558/copy_const174_const" type="Const" version="opset1">
			<data element_type="f32" offset="106260" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="68" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="713717_const" type="Const" version="opset1">
			<data element_type="f32" offset="106516" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="41" name="714718_const" type="Const" version="opset1">
			<data element_type="f32" offset="106520" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="42" name="715719_const" type="Const" version="opset1">
			<data element_type="f32" offset="106516" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="43" name="716720_const" type="Const" version="opset1">
			<data element_type="f32" offset="106520" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="44" name="69/Ins_Norm/MVN_/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="69/Ins_Norm/MVN_" type="MVN" version="opset2">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="onnx_initializer_node_in2.weight/Output_0/Data_/copy/copy_const177_const" type="Const" version="opset1">
			<data element_type="f32" offset="106524" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="69/Ins_Norm/mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="onnx_initializer_node_in2.bias/Output_0/Data_/copy/copy_const179_const" type="Const" version="opset1">
			<data element_type="f32" offset="106780" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="69/Ins_Norm/add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="70" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="953957_const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="52" name="954958_const" type="Const" version="opset1">
			<data element_type="f32" offset="107036" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="53" name="955959_const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="54" name="956960_const" type="Const" version="opset1">
			<data element_type="f32" offset="107036" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="55" name="72/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="onnx_initializer_node_conv3.conv2d.weight/Output_0/Data__const182_const" type="Const" version="opset1">
			<data element_type="f32" offset="107040" shape="128,64,3,3" size="294912"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="963967_const" type="Const" version="opset1">
			<data element_type="f32" offset="401952" shape="128,1,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="964968_const" type="Const" version="opset1">
			<data element_type="f32" offset="402464" shape="128,1,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="965969_const" type="Const" version="opset1">
			<data element_type="f32" offset="401952" shape="128,1,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="966970_const" type="Const" version="opset1">
			<data element_type="f32" offset="402464" shape="128,1,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="72/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="72/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>120</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="72/Dims2582/copy_const184_const" type="Const" version="opset1">
			<data element_type="f32" offset="402976" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="72" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="723727_const" type="Const" version="opset1">
			<data element_type="f32" offset="403488" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="66" name="724728_const" type="Const" version="opset1">
			<data element_type="f32" offset="403492" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="67" name="725729_const" type="Const" version="opset1">
			<data element_type="f32" offset="403488" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="68" name="726730_const" type="Const" version="opset1">
			<data element_type="f32" offset="403492" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="69" name="73/Ins_Norm/MVN_/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="73/Ins_Norm/MVN_" type="MVN" version="opset2">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="onnx_initializer_node_in3.weight/Output_0/Data_/copy/copy_const187_const" type="Const" version="opset1">
			<data element_type="f32" offset="403496" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="73/Ins_Norm/mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="onnx_initializer_node_in3.bias/Output_0/Data_/copy/copy_const189_const" type="Const" version="opset1">
			<data element_type="f32" offset="404008" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="73/Ins_Norm/add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="74" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="863867_const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="77" name="864868_const" type="Const" version="opset1">
			<data element_type="f32" offset="404520" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="78" name="865869_const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="79" name="866870_const" type="Const" version="opset1">
			<data element_type="f32" offset="404520" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="80" name="76/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="onnx_initializer_node_res1.conv1.conv2d.weight/Output_0/Data__const192_const" type="Const" version="opset1">
			<data element_type="f32" offset="404524" shape="128,128,3,3" size="589824"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="873877_const" type="Const" version="opset1">
			<data element_type="f32" offset="994348" shape="128,1,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="874878_const" type="Const" version="opset1">
			<data element_type="f32" offset="994860" shape="128,1,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="875879_const" type="Const" version="opset1">
			<data element_type="f32" offset="994348" shape="128,1,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="876880_const" type="Const" version="opset1">
			<data element_type="f32" offset="994860" shape="128,1,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="76/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="76/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="76/Dims2528/copy_const194_const" type="Const" version="opset1">
			<data element_type="f32" offset="995372" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="76" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="923927_const" type="Const" version="opset1">
			<data element_type="f32" offset="995884" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="91" name="924928_const" type="Const" version="opset1">
			<data element_type="f32" offset="995888" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="92" name="925929_const" type="Const" version="opset1">
			<data element_type="f32" offset="995884" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="93" name="926930_const" type="Const" version="opset1">
			<data element_type="f32" offset="995888" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="94" name="77/Ins_Norm/MVN_/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="77/Ins_Norm/MVN_" type="MVN" version="opset2">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="onnx_initializer_node_res1.in1.weight/Output_0/Data_/copy/copy_const197_const" type="Const" version="opset1">
			<data element_type="f32" offset="995892" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="77/Ins_Norm/mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="onnx_initializer_node_res1.in1.bias/Output_0/Data_/copy/copy_const199_const" type="Const" version="opset1">
			<data element_type="f32" offset="996404" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="77/Ins_Norm/add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="78" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="633637_const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="102" name="634638_const" type="Const" version="opset1">
			<data element_type="f32" offset="996916" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="103" name="635639_const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="104" name="636640_const" type="Const" version="opset1">
			<data element_type="f32" offset="996916" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="105" name="80/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="onnx_initializer_node_res1.conv2.conv2d.weight/Output_0/Data__const202_const" type="Const" version="opset1">
			<data element_type="f32" offset="996920" shape="128,128,3,3" size="589824"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="643647_const" type="Const" version="opset1">
			<data element_type="f32" offset="1586744" shape="128,1,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="644648_const" type="Const" version="opset1">
			<data element_type="f32" offset="1587256" shape="128,1,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="645649_const" type="Const" version="opset1">
			<data element_type="f32" offset="1586744" shape="128,1,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="646650_const" type="Const" version="opset1">
			<data element_type="f32" offset="1587256" shape="128,1,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="80/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="80/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="80/Dims2510/copy_const204_const" type="Const" version="opset1">
			<data element_type="f32" offset="1587768" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="80" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="733737_const" type="Const" version="opset1">
			<data element_type="f32" offset="1588280" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="116" name="734738_const" type="Const" version="opset1">
			<data element_type="f32" offset="1588284" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="117" name="735739_const" type="Const" version="opset1">
			<data element_type="f32" offset="1588280" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="118" name="736740_const" type="Const" version="opset1">
			<data element_type="f32" offset="1588284" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="119" name="81/Ins_Norm/MVN_/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="81/Ins_Norm/MVN_" type="MVN" version="opset2">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="onnx_initializer_node_res1.in2.weight/Output_0/Data_/copy/copy_const207_const" type="Const" version="opset1">
			<data element_type="f32" offset="1588288" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="81/Ins_Norm/mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="onnx_initializer_node_res1.in2.bias/Output_0/Data_/copy/copy_const209_const" type="Const" version="opset1">
			<data element_type="f32" offset="1588800" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="81/Ins_Norm/add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="533537_const" type="Const" version="opset1">
			<data element_type="f32" offset="1589312" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="126" name="534538_const" type="Const" version="opset1">
			<data element_type="f32" offset="1589316" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="127" name="535539_const" type="Const" version="opset1">
			<data element_type="f32" offset="1589312" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="128" name="536540_const" type="Const" version="opset1">
			<data element_type="f32" offset="1589316" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="129" name="82/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="82" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="573577_const" type="Const" version="opset1">
			<data element_type="f32" offset="1589320" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="132" name="574578_const" type="Const" version="opset1">
			<data element_type="f32" offset="1589324" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="133" name="575579_const" type="Const" version="opset1">
			<data element_type="f32" offset="1589320" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="134" name="576580_const" type="Const" version="opset1">
			<data element_type="f32" offset="1589324" shape="" size="4"/>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="135" name="84/WithoutBiases/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="onnx_initializer_node_res2.conv1.conv2d.weight/Output_0/Data__const212_const" type="Const" version="opset1">
			<data element_type="f32" offset="1589328" shape="128,128,3,3" size="589824"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="583587_const" type="Const" version="opset1">
			<data element_type="f32" offset="2179152" shape="128,1,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="584588_const" type="Const" version="opset1">
			<data element_type="f32" offset="2179664" shape="128,1,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="585589_const" type="Const" version="opset1">
			<data element_type="f32" offset="2179152" shape="128,1,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="140" name="586590_const" type="Const" version="opset1">
			<data element_type="f32" offset="2179664" shape="128,1,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="84/WithoutBiases/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="142" name="84/WithoutBiases" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>60</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="143" name="84/Dims2552/copy_const214_const" type="Const" version="opset1">
			<data element_type="f32" offset="2180176" shape="1,128,1,1" size="512"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
